mkdir -p 0.プログラミング入門/0.Python入門/0.Pythonに触れてみる
mkdir -p 0.プログラミング入門/0.Python入門/1.ロジックを組み立てる
mkdir -p 0.プログラミング入門/1.Python基礎/0.Pyhtnonの理解を深める
mkdir -p 0.プログラミング入門/1.Python基礎/1.コーディングスキルを向上する

mkdir -p 1.コーディングによる問題解決/0.ロジック実装初級/0.標準入出力
mkdir -p 1.コーディングによる問題解決/0.ロジック実装初級/1.条件とループ
mkdir -p 1.コーディングによる問題解決/0.ロジック実装初級/2.ループの応用
mkdir -p 1.コーディングによる問題解決/0.ロジック実装初級/3.FizzBuzzの完全理解

mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/0.文字と文字列
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/1.最大値と集計
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/2.さまざまなトピック
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/3.練習問題集

mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/0.計算量削減の工夫
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/1.メモ化再帰
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/2.代表的なデータ構造
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/3.ビット
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/4.動的計画法
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/5.二分探索法
mkdir -p 1.コーディングによる問題解決/1.ロジック実装中級/6.貪欲法

mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/0.全探索
mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/1.配列
mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/2.ソートの基礎
mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/3.再帰関数
mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/4.地所と集合
mkdir -p 1.コーディングによる問題解決/2.アルゴリズム初級/5.グラフ

mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/0.計算量削減の工夫
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/1.メモ化再帰
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/2.代表的なデータ構造
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/3.ビット
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/4.動的計画法
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/5.二分探索法
mkdir -p 1.コーディングによる問題解決/3.アルゴリズム中級/6.貪欲法

mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/0.配列の応用
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/1.ビット全探索
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/2.代表的なデータ構造の活用
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/3.動的計画法の活用
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/4.ソート
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/5.グラフ探索
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/6.最短経路問題
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/7.発展的なグラフの話題
mkdir -p 1.コーディングによる問題解決/4.アルゴリズム上級/8.発展的な木の話題

mkdir -p 1.コーディングによる問題解決/5.整数論的アルゴリズム/0.約数と素数
mkdir -p 1.コーディングによる問題解決/5.整数論的アルゴリズム/1.公約数
mkdir -p 1.コーディングによる問題解決/5.整数論的アルゴリズム/2.練習問題
mkdir -p 1.コーディングによる問題解決/5.整数論的アルゴリズム/3.高等アルゴリズム

mkdir -p 2.エンジニアリング技術/0.データベース初級/0.データの表示
mkdir -p 2.エンジニアリング技術/0.データベース初級/1.データの集計と編集
mkdir -p 2.エンジニアリング技術/0.データベース初級/2.基本的な操作
mkdir -p 2.エンジニアリング技術/0.データベース初級/3.練習問題
mkdir -p 2.エンジニアリング技術/1.データベース中級/0.練習問題（初級の復習）
mkdir -p 2.エンジニアリング技術/1.データベース中級/1.データベースの設計
mkdir -p 2.エンジニアリング技術/1.データベース中級/2.テーブルの結合
mkdir -p 2.エンジニアリング技術/1.データベース中級/3.テーブルの作成
mkdir -p 2.エンジニアリング技術/2.プログラミング技法/0.プログラミング技法

mkdir -p 3.コンピューターサイエンス/0.ネットワークとセキュリティ/0.暗号化技術
mkdir -p 3.コンピューターサイエンス/0.ネットワークとセキュリティ/1.脅威・脆弱性とその対策
mkdir -p 3.コンピューターサイエンス/0.ネットワークとセキュリティ/2.ネットワークの全体像
mkdir -p 3.コンピューターサイエンス/0.ネットワークとセキュリティ/3.TCP/IPを用いた通信
mkdir -p 3.コンピューターサイエンス/0.ネットワークとセキュリティ/4.ネットワークのセキュリティ対策
mkdir -p 3.コンピューターサイエンス/1.データ表現と正規表現/0.ビット演算
mkdir -p 3.コンピューターサイエンス/1.データ表現と正規表現/1.位取り記数法
mkdir -p 3.コンピューターサイエンス/1.データ表現と正規表現/2.コンピュータ上でのデータ表現
mkdir -p 3.コンピューターサイエンス/1.データ表現と正規表現/3.正規表現

mkdir -p 4.数理素養/0.プログラミングのための数学/0.数と文字式の復習
mkdir -p 4.数理素養/0.プログラミングのための数学/1.さまざまな関数
mkdir -p 4.数理素養/1.論理的思考力/0.確率を理解する
mkdir -p 4.数理素養/1.論理的思考力/1.規則性を見出す
mkdir -p 4.数理素養/1.論理的思考力/2.論理的思考力を身につける
mkdir -p 4.数理素養/1.論理的思考力/3.論理的思考力を磨く
mkdir -p 4.数理素養/2.基礎数理/0.1次方程式を極める
mkdir -p 4.数理素養/2.基礎数理/1.文字式の計算を極める
mkdir -p 4.数理素養/2.基礎数理/2.2次方程式を極める
mkdir -p 4.数理素養/2.基礎数理/3.1次関数を理解する
mkdir -p 4.数理素養/2.基礎数理/4.2次関数を理解する
mkdir -p 4.数理素養/2.基礎数理/5.三角比を理解する
mkdir -p 4.数理素養/3.プログラミングで学ぶ数学/0.基礎概念
mkdir -p 4.数理素養/3.プログラミングで学ぶ数学/1.微分法と積分法
mkdir -p 4.数理素養/3.プログラミングで学ぶ数学/2.場合の数
mkdir -p 4.数理素養/3.プログラミングで学ぶ数学/3.確率
mkdir -p 4.数理素養/3.プログラミングで学ぶ数学/4.期待値
mkdir -p 4.数理素養/4.データリテラシー/0.データの表現法を学ぶ
mkdir -p 4.数理素養/4.データリテラシー/1.機械学習
mkdir -p 4.数理素養/5.データサイエンス初級/0.統計学入門
mkdir -p 4.数理素養/5.データサイエンス初級/1.プログラミング実習
mkdir -p 4.数理素養/6.データサイエンス中級/0.統計学のための確率
mkdir -p 4.数理素養/6.データサイエンス中級/1.統計学基礎
mkdir -p 4.数理素養/6.データサイエンス中級/2.統計分析手法
mkdir -p 4.数理素養/6.データサイエンス中級/3.課題解決のアプローチ
mkdir -p 4.数理素養/6.データサイエンス中級/4.機械学習基礎

for dir in `find . -type d`; do
    if [[ $dir == ./.git* ]]; then
        continue
    fi
    touch "$dir/.gitkeep"
done